Revit 2027 API
DividedSurface.ComponentRotation Property
The rotation of the pattern by a multiple of 90 degrees.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ComponentRotation ComponentRotation { get; set; }
Public Property ComponentRotation As ComponentRotation
	Get
	Set
public:
property ComponentRotation ComponentRotation {
	ComponentRotation get ();
	void set (ComponentRotation value);
}
member ComponentRotation : ComponentRotation with get, set
Property Value
ComponentRotation
Remarks
This property has no effect unless a pattern is selected (the ObjectType property is not null).
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace